<a href="https://colab.research.google.com/github/Ananya-Jha-code/Python-and-its-libraries/blob/main/Pandas_basic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd
import random

# Random pets column
pet_list = ["cat", "hamster", "alligator", "snake"]
pet = [random.choice(pet_list) for i in range(1,15)]

# Random weight of animal column
weight = [random.choice(range(5,15)) for i in range(1,15)]

# Random length of animals column
length = [random.choice(range(1,10)) for i in range(1,15)]

# random age of the animals column
age = [random.choice(range(1,15)) for i in range(1,15)]

# Put everyhting into a dataframe
df = pd.DataFrame()
df["animal"] = pet
df["age"] = age
df["weight"] = weight
df["length"] = length
# make a groupby object
animal_groups = df.groupby("animal")

In [2]:
#df = pd.read_csv('data.csv')
df

       animal  age  weight  length
0     hamster    9      14       5
1       snake   13      12       9
2     hamster    3      10       4
3       snake   11      11       8
4   alligator    4      12       4
5       snake   14       5       2
6     hamster   14       5       4
7       snake   11       9       1
8       snake    4      12       8
9         cat    8       5       3
10  alligator   13       6       9
11        cat   13      12       7
12        cat    8       5       2
13    hamster   10       8       6

In [3]:
# Read Headers
df.columns

Index(['animal', 'age', 'weight', 'length'], dtype='object')

In [14]:
dfsort=df.sort_values(['animal', 'age'], ascending=[1,1])

dfsort

       animal  age  weight  length
4   alligator    4      12       4
10  alligator   13       6       9
9         cat    8       5       3
12        cat    8       5       2
11        cat   13      12       7
2     hamster    3      10       4
0     hamster    9      14       5
13    hamster   10       8       6
6     hamster   14       5       4
8       snake    4      12       8
3       snake   11      11       8
7       snake   11       9       1
1       snake   13      12       9
5       snake   14       5       2

In [21]:
# Group by category
animal_groups = df.groupby("animal")

In [19]:
# Apply the "mean" function to the weight column
animal_groups['weight'].mean()

animal
alligator    9.000000
cat          7.333333
hamster      9.250000
snake        9.800000
Name: weight, dtype: float64

In [20]:
# Or apply the "max" function to the age column
animal_groups['age'].max()

animal
alligator    13
cat          13
hamster      14
snake        14
Name: age, dtype: int64

In [44]:
df.to_csv('modified.csv', index=False)